#+TITLE: Formalizing graph theory in type theory
#+AUTHOR: Siraphob (Ben) Phipathananunth
#+OPTIONS: toc:nil
#+LATEX_CLASS: scrartcl
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{bussproofs}
#+LATEX_HEADER: \usepackage{amsthm}
#+LATEX_HEADER: \usepackage{coqdoc}
#+LATEX_HEADER: \usepackage{algpseudocode,algorithm,algorithmicx}
#+LATEX_HEADER: \newtheorem*{thm*}{Theorem}
#+LATEX_HEADER: \newtheorem{thm}{Theorem}
#+LATEX_HEADER: \newtheorem*{lem}{Lemma}
#+LATEX_HEADER: \usepackage[backend=biber]{biblatex}
#+LATEX_HEADER: \addbibresource{citations.bib}

\newcommand{\typ}{\,:\,}
\newcommand{\lam}[2]{\lambda #1.\,#2}
\newcommand{\app}[2]{#1\,#2}
\newcommand{\red}{\to_\beta}
\newcommand{\tred}{\twoheadrightarrow_\beta}

#+BEGIN_abstract
Despite the rich theory and extensive applications of graph theory in
computer science and mathematics, formal developments of graph theory
have mostly been restricted to specific applications or definitions of
graphs. In this work we present progress towards formalization of
Wigderson's graph coloring algorithm through our own novel
approach. We also provide a comprehensive review of various
formalization approaches found in the literature, examining their
motivations, theoretical design choices, and the robustness of their
conclusions.
#+END_abstract

#+BEGIN_comment
Notes for presentation later:
- interesting thing is that this work involves simultaneously ideas
  from logic, type theory, graph theory and computer science
#+END_comment

#+BEGIN_comment
• Introduction
  • Historical context for logics, formalization of mathematics
• Overview of dependent type theory
  • Comparisons with set theory and first-order theories
  • Curry-Howard correspondence
  • Constructivism and axioms
  • Representation of mathematical objects in type theory
• Overview of graph theory formalizations in Coq
  • math-comp (2008), formalization of four-color theorem
** Phase II
We fully define the second phase of the algorithm. First we write a
function to iteratively extract a vertex of a given degree and remove
it from a graph. Separately, we also prove that if the degree d that
was given is the max degree, then ~extract_vertices_deg~ exhausts all
the vertices of max degree, and the graph returned has a maximum
degree of one less. Here, we have to provide a proof of termination
using the ~measure~ keyword in Coq, since Coq does not allow
non-terminating functions. We use the fact that the size of the graph
is decreasing at each step.

#+BEGIN_SRC coq
Function extract_vertices_deg (g : graph) (d : nat) {measure M.cardinal g}
    : list (node * graph) * graph :=
  match extract_deg_vert_dec g d with
  | inl v =>
      let (l, g') := extract_vertices_deg (remove_node (`v) g) d in
      ((`v, g') :: l, g')
  | inr _ => (nil, g)
  end.

Function phase2 (g : graph) {measure max_deg g} : coloring * graph :=
  match max_deg g with
  | 0 => (constant_color (nodes g) 1, (@M.empty _))
  | S n => let (ns, g') := extract_vertices_deg g (S n) in
          let ns' := SP.of_list (map fst ns) in
          let (f', g'') := phase2 g' in
          (Munion (constant_color ns' (Pos.of_nat (S n))) f', g'')
  end.
#+END_SRC

We provide a summary of the development statistics in the following
table.

#+CAPTION: Statistics of our graph theory development.
| *Filename*    | *Blank lines* | *Comment lines* | *Code lines* |
|-------------+-------------+---------------+------------|
| ~subgraph.v~  |         138 |           131 |       1145 |
| ~coloring.v~  |          80 |           146 |        994 |
| ~graph.v~     |         122 |           173 |        407 |
| ~wigderson.v~ |          47 |           119 |        228 |
| ~restrict.v~  |          14 |             6 |        181 |
| ~munion.v~    |           6 |             6 |         63 |
|-------------+-------------+---------------+------------|
| *Total*       |         407 |           581 |       3018 |
#+TBLFM: @>$2=vsum(@I..@II)::@>$3=vsum(@I..@II)::@>$4=vsum(@I..@II)

\newpage

